#!/bin/python3

bites = {
    'post-1-0-55813400-1440831680' : "Мясо рапана",
    'post-1-0-66027600-1440762771' : "Мясо мидии",
    'post-1-0-85012000-1440756630' : "Икринка",
    "post-1-0-31961200-1440760469" : "Живец",
    "post-1-0-49768600-1440831650" : "Мясо моллюска",
    'post-1-0-75358300-1440680678' : "Поденка",
    'post-1-0-77247700-1527047139' : 'Личинка ручейника',
    'post-1-0-01716700-1440680816' : 'Мотыль',
    'post-1-0-04805500-1440680910' : 'Личинка короеда',
    'post-1-0-35424300-1440681061' : 'Бокоплав',
    'post-1-0-74425100-1440831437' : 'Муха',
    'post-1-0-23744500-1440759070' : 'Кузнечик',
    'post-1-0-37540200-1440757047' : 'Креветка',
    'kusochek_sala' : 'Кусок сала',
    'post-1-0-09412400-1439478508' : 'Дождевой червь',
    "post-1-0-76968300-1440677782" : 'Мотыль',
    # '' : '',
    # '' : '',
    # '' : '',
    # '' : '',
    # '' : '',
    # '' : '',
    # '' : '',
    # '' : '',
    # '' : '',
}

with open('bites_forum') as file:
    raw = file.read()

    nole = raw.replace('\n', '')

    pics = nole.split('.png')

    del pics[-1]

    # print(pics)

    for p in pics:
        print("    - " + bites[p])
